In [1]:
#Pandas library --it is used for data processing and analysis
import pandas as pd
s1=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"],dtype=int)
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
import pandas as pd
import numpy as np
my_Data=np.random.randint(0,101,(4,3))

In [5]:
my_Data

array([[80, 20, 30],
       [19, 30, 80],
       [48, 38, 97],
       [63,  7, 98]], dtype=int32)

In [6]:
my_index=["India","Japan","Australia","Newziland"]

In [7]:
column=["jan","feb","mar"]

In [8]:
df=pd.DataFrame(my_Data,index=my_index,columns=column)
df

           jan  feb  mar
India       80   20   30
Japan       19   30   80
Australia   48   38   97
Newziland   63    7   98

In [30]:
df=pd.read_csv("C:\\Users\\yadnya vikhe\\Downloads\\Crop_Production_Data.csv",encoding="latin1")

In [31]:
#head() - is used to display first few rows od a DataFrame
df.head(3)

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Rice,102.0,321.0

In [32]:
#tail()- is used to display last few rows od a DataFrame
df.tail(2)

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
246089,West Bengal,PURULIA,2014.0,Winter,Rice,279151.0,597899.0
246090,West Bengal,PURULIA,2014.0,Winter,Sesamum,175.0,88.0

In [33]:
#it is used to display for the columns
df.columns

Index(['State_Name', 'District_Name', 'Crop_Year', 'Season', 'Crop', 'Area',
       'Production'],
      dtype='object')

In [34]:
#index is used to get the index
df.index

RangeIndex(start=0, stop=246091, step=1)

In [35]:
df.describe()

           Crop_Year          Area    Production
count  245992.000000  2.455800e+05  2.423400e+05
mean     2005.643029  1.201657e+04  5.825539e+05
std         4.952342  5.057104e+04  1.706655e+07
min      1997.000000  4.000000e-02  0.000000e+00
25%      2002.000000  8.000000e+01  8.800000e+01
50%      2006.000000  5.830000e+02  7.290000e+02
75%      2010.000000  4.400000e+03  7.025000e+03
max      2015.000000  8.580100e+06  1.250800e+09

In [39]:
#rename()- it is used to chnge the column name
df=df.rename(columns={"State_Name":"State name","Crop_Year":"Crop Year"})

In [42]:
df.head(7)

,State name,District_Name,Crop Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Cashewnut,720.0,165.0
5,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Coconut,18168.0,65100000.0
6,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Dry ginger,36.0,100.0

In [43]:
df.tail(4)

,State name,District_Name,Crop Year,Season,Crop,Area,Production
246087,West Bengal,PURULIA,2014.0,Summer,Sesamum,627.0,463.0
246088,West Bengal,PURULIA,2014.0,Whole Year,Sugarcane,324.0,16250.0
246089,West Bengal,PURULIA,2014.0,Winter,Rice,279151.0,597899.0
246090,West Bengal,PURULIA,2014.0,Winter,Sesamum,175.0,88.0

In [44]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Crop Year,245992.0,2005.643029,4.952342e+00,1997.00,2002.0,2006.0,2010.0,2.015000e+03
Area,245580.0,12016.570878,5.057104e+04,0.04,80.0,583.0,4400.0,8.580100e+06
Production,242340.0,582553.872144,1.706655e+07,0.00,88.0,729.0,7025.0,1.250800e+09

In [48]:
#to extract out single column or multiple column
df[["Crop"]].head(10)

                  Crop
0             Arecanut
1  Other Kharif pulses
2                 Rice
3               Banana
4            Cashewnut
5             Coconut
6           Dry ginger
7            Sugarcane
8         Sweet potato
9              Tapioca

In [50]:
#DROP-- in case of deleting multiple column
#df.drop(['Crop','Year'].axis=1)

In [54]:
df.head(3)

,State name,District_Name,Crop Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Rice,102.0,321.0

In [55]:
df=df.reset_index()

In [56]:
df.head(2)

,index,State name,District_Name,Crop Year,Season,Crop,Area,Production
0,0,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Arecanut,1254.0,2000.0
1,1,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Other Kharif pulses,2.0,1.0

In [57]:
#To select any specific rows with index position
df.iloc[0]

index                                      0
State name       Andaman and Nicobar Islands
District_Name                       NICOBARS
Crop Year                             2000.0
Season                           Kharif
Crop                                Arecanut
Area                                  1254.0
Production                            2000.0
Name: 0, dtype: object

In [58]:
#for selecting some subsection of the dataframe
df.iloc[1:5]

,index,State name,District_Name,Crop Year,Season,Crop,Area,Production
1,1,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Other Kharif pulses,2.0,1.0
2,2,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Rice,102.0,321.0
3,3,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Banana,176.0,641.0
4,4,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Cashewnut,720.0,165.0

In [61]:
df.head(7)

,index,State name,District_Name,Crop Year,Season,Crop,Area,Production
0,0,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Arecanut,1254.0,2000.0
1,1,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Other Kharif pulses,2.0,1.0
2,2,Andaman and Nicobar Islands,NICOBARS,2000.0,Kharif,Rice,102.0,321.0
3,3,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Banana,176.0,641.0
4,4,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Cashewnut,720.0,165.0
5,5,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Coconut,18168.0,65100000.0
6,6,Andaman and Nicobar Islands,NICOBARS,2000.0,Whole Year,Dry ginger,36.0,100.0